marker_teza = ['На мою думку,', 'Я вважаю, що', 'Я думаю, що', 'Мені здається, що',
               'На моє переконання,', 'Мій погляд на цю проблему такий:']

marker_teza_subargs_start = ['бо', 'адже']
marker_teza_subargs_delim = ['і', 'та', 'й']

marker_argument = ['По-перше', 'По-друге,', 'Я так вважаю, тому що',
                   'Аргументом на користь моєї думки може бути те, що']

marker_example_literature = ['На згадку приходить', 'У зв’язку з порушеною проблемою хочеться згадати',
                             'Тема мого роздуму порушується у']

marker_example_life = ['Хочу навести приклад із власного життя:',
                       'Хоча мій власний життєвий досвід ще порівняно малий, можу сказати, що']

marker_finish = ['Отже, можна дійти висновку, що', 'Отже,', 'Підсумовуючи, можна зазначити:',
                 'Таким чином, можна зробити висновок, що', 'Таким чином,',
                 'На завершення свого роздуму, підсумую:']