marker_teza = ['На мою думку,', 'Я вважаю, що', 'Я думаю, що', 'Мені здається, що',
               'На моє переконання,', 'Мій погляд на цю проблему такий:']

marker_teza_subargs_start = ['бо', 'адже']
marker_teza_subargs_delim = ['і', 'та', 'й']

marker_argument = ['По-перше', 'По-друге,', 'Я так вважаю, тому що',
                   'Аргументом на користь моєї думки може бути те, що']

marker_example_literature = ['На згадку приходить', 'У зв’язку з порушеною проблемою хочеться згадати',
                             'Тема мого роздуму порушується у']

marker_example_life = ['Хочу навести приклад із власного життя:',
                       'Хоча мій власний життєвий досвід ще порівняно малий, можу сказати, що']

marker_finish = ['Отже, можна дійти висновку, що', 'Отже,', 'Підсумовуючи, можна зазначити:',
                 'Таким чином, можна зробити висновок, що', 'Таким чином,',
                 'На завершення свого роздуму, підсумую:']

argument_connections = ['треба зазначити, що', 'необхідно відмітити, що', 'треба зазначити,', 'необхідно відмітити,',
                        'варто уваги те, що']

argument_choice_positive_connections = ['обираючи *, ти зможеш', 'обираючи *, ти можеш',
                                        'обираючи *, людина може', 'обираючи *, людина зможе',
                                        'треба обирати *, оскільки', 'треба обирати *, тому що',
                                        'треба обирати *, тому бо', '* дозволяє тобі', '* дозволяє людині',
                                        '* дозволяє', '* дає змогу', 'достатньо *, щоб',
                                        'добре, коли *, бо', 'добре, коли *, оскільки', 'добре, коли *, тому що',
                                        'добре, * бо', 'добре, * оскільки', 'добре, * тому що',
                                        'обираючи *, тобі доступне', 'обираючи *, тобі доступні']

argument_choice_negative_connections = ['варіант * не є привабливим,', 'варіант * не привабливий,',
                                        'варіант * не є привабливим, бо', 'варіант * не привабливий, бо',
                                        'варіант * не є привабливим, оскільки', 'варіант * не привабливий, оскільки',
                                        'варіант * не є привабливим, тому що', 'варіант * не привабливий, тому що',
                                        'не треба обирати *,', 'важко обрати *,',
                                        'не треба обирати *, тому що', 'важко обрати *, тому що',
                                        'не треба обирати *, оскільки', 'важко обрати *, оскільки',
                                        'важко обрати *, бо', 'важко обрати *, оскільки', 'важко обрати *, тому що',
                                        'погано *, бо', 'погано *, тому що', 'погано *, оскільки',
                                        'погано, коли *, бо', 'погано, коли *, тому що', 'погано, коли *, оскільки']
